In [108]:
import pandas as pd
import numpy as np

## Creating Data Frame

In [109]:
data = {
    'name ' : ["hari","krishna","akhil","kumar"],
    "age" : [18,19,20,21],
    "year" : [2002 ,2001 ,2000 ,1999]
}

In [110]:
data

{'name ': ['hari', 'krishna', 'akhil', 'kumar'],
 'age': [18, 19, 20, 21],
 'year': [2002, 2001, 2000, 1999]}

In [111]:
df1 = pd.DataFrame(data)           # must write " DataFrame " like this only , don't write " dataframe "
df1

     name   age  year
0     hari   18  2002
1  krishna   19  2001
2    akhil   20  2000
3    kumar   21  1999

## Setting Index

In [112]:
dff = pd.DataFrame(data , index = ["1" ,'2' , '3' ,'4'])
dff

     name   age  year
1     hari   18  2002
2  krishna   19  2001
3    akhil   20  2000
4    kumar   21  1999

## Extracting Info

#### loc

In [113]:
dff.loc["1"]     # use only the Square Brackets .  String if we given manually Index , Except this Remaing all same as Without Manual Index

name     hari
age        18
year     2002
Name: 1, dtype: object

#### iloc

In [114]:
dff.iloc[0]            # iloc - will choose normal Index Not manual Index

name     hari
age        18
year     2002
Name: 1, dtype: object

In [143]:
dff.iloc[0:2]          # iloc - will choose normal Index Not manual Index

     name   age  year
1     hari   18  2002
2  krishna   19  2001

In [132]:
dff.iloc[1:3 , 1:2]    # This is the Main Purpose of iloc

   age
2   19
3   20

### Without Manual Index

In [117]:
df2 = pd.DataFrame(data)
df2

     name   age  year
0     hari   18  2002
1  krishna   19  2001
2    akhil   20  2000
3    kumar   21  1999

#### loc

In [134]:
df2.loc[1]     # Don't use string for Index , without Manual Index

name     krishna
age           19
year        2001
Name: 1, dtype: object

In [154]:
df2.loc[1:3]           # ***** In loc it will take start & end values [1:2 = 1,2] , [0:3 = 0,1,2,3],....

     name   age  year
1  krishna   19  2001
2    akhil   20  2000
3    kumar   21  1999

In [155]:
df2.loc[1:2]     # Don't use string for Index , without Manual Index

     name   age  year
1  krishna   19  2001
2    akhil   20  2000

#### iloc

In [129]:
df2.iloc[1]   # It will Choose Normal Index value

name     krishna
age           19
year        2001
Name: 1, dtype: object

In [140]:
df2.iloc[1:2]

     name   age  year
1  krishna   19  2001

In [146]:
df2.iloc[2:6]   # It will Choose Normal Index value

   name   age  year
2  akhil   20  2000
3  kumar   21  1999

## Main purpose of iloc

In [122]:
df2.iloc[1:3 , 1:2]         # 1:3 = row   And  1:2 = column , This type will work only in iloc , This is the Main Purpose of iloc

   age
1   19
2   20

In [123]:
df2.iloc[:4 , -2:-1]        # This is the Main Purpose of iloc

   age
0   18
1   19
2   20
3   21

#### or

In [130]:
df2.iloc[:4 , 1:2]           # If we given column as 1:2 , 2:3 , -3:-1 ,...., Then O/p will Show in Table Formate

   age
0   18
1   19
2   20
3   21

#### or

In [125]:
df2.iloc[:4 , 1]       # If we given column as 1 , 2 , -2  ...., Then O/p will not Show in Table Formate

0    18
1    19
2    20
3    21
Name: age, dtype: int64

### If we want to select all rows means then use [: , value]

In [126]:
df2.iloc[: , -3:-1]

     name   age
0     hari   18
1  krishna   19
2    akhil   20
3    kumar   21

#### or

In [127]:
df2.iloc[: , 2]

0    2002
1    2001
2    2000
3    1999
Name: year, dtype: int64